{
  "date": "10th Aug 2020",
  "order": 1,
  "title": "Redefining the mobile experience of WA's largest NFP health insurer",
  "tags": [
    "HBF: Mobile App"
  ],
  "intro": "<br>\n\nHBF is the largest not-for-profit health insurer based in the West Coast of Australia, and have recently launched in the East. Being a NFP, they are intrinsically member-focused and ensure everything they do gives back to their users.\n\n<p>\n\nAs part of their larger Digital Transformation program, PwC Digital was engaged to help HBF transform its member experience to deliver a delightful omnichannel experience across its digital ecosystem, and lead their business strategy for their expansion into the East Coast.\n\n<p>\nA key focus for the digital transformation included co-creating an experience-led approach to reimagine HBF's web and mobile app experience.",
  "thumbnail": "/images/uploads/hbf.png",
  "descriptionTexts": [
    {
      "descriptionText": "<h2>We co-designed, built and launched a market leading mobile app experience for HBF's members.</h2>"
    },
    {
      "descriptionText": "<h2> The outcome </h2>\n\n<p>\n\nAfter launch, the HBF team, who we worked closely with, had embedded a cadence of design, testing and iteration for continuous improvement of the iOS and Android apps.\n\n<p>\n\nThe apps were incredibly well-received by HBF members, with the App Store ratings skyrocketing from 2.4 to 4.8 (with over 3K reviews). The mobile app engagement and usage has also increased significantly with the addition of new features.",
      "descriptionImage": "/images/uploads/hbf-2.png"
    },
    {
      "descriptionText": "<h2>Key outputs</h2>\n\n<p>\n\n\\ iOS & Android app design, build & delivery\n\n<p>\n\n\\ Redefined HBF Brand & Digital ecosystem\n\n<p>\n\n\\ Launch strategy & Future Horizons Roadmap\n\n<p>\n\n\\ Scalable Figma & code-based Design System\n\n<p>\n\n\\ Co-design & testing insights\n\n<p>\n\n\\ Technical implementation & integration\n\n<p>\n\n<h2>Core Team </h2>\n\n<p>\n\nJo Pforr - Product Manager\n\n<p>\n\nCecilia Bartels - Business Analyst\n\n<p>\n\nErika Osti - Designer\n\n<p>\n\nPhil Lauricella - Designer\n\n<p>\n\nBen Martin - Solution Architect\n\n<p>\n\nThai Phan - Developer\n\n<p>\n\nAydan Bedingham - Developer\n\n<p>\n\nDomenico Soldo - Developer\n\n<p>\n\nTyron Boyd - Developer\n\n<p>\n\n<h2> Agency </h2>\n\n<p>\n\nPwC Digital"
    }
  ]
}