{
  "order": 1,
  "title": "Helping Australians save on their energy bills",
  "date": "12th Aug 2019",
  "thumbnail": "/images/uploads/energy-switch.png",
  "tags": [
    "Service NSW: Web App"
  ],
  "intro": "<p>\n\n<p>\n\nService NSW (SNSW) makes it easier for NSW residents and businesses to access government information and services.\n\n<p>\n\nAs part of their Cost of Living initiative, the team at Mentally Friendly designed and launched a service that would empower NSW citizens to find the right energy plan for their needs.\n\n<p>\n\nenergyswitch.service.nsw.gov.au",
  "descriptionTexts": [
    {
      "descriptionText": "<br>\n\n<h2>The challenge</h2>\n\n<p>\n\nAround 70% of people are paying more than they need for their energy. This happens for a number of reasons including a lack of engagement with utilities, high levels of friction involved in the switching process, and general distrust in energy providers and comparison sites.\n\n<p>\n\nAs a result, many people unknowingly stay with overpriced legacy plans, when they could be saving by switching to a newer plan.",
      "descriptionImage": "/images/uploads/snsw-energy-switch-2.png"
    },
    {
      "descriptionText": "<br>\n\n<h2>From prototype to delivery </h2>\n\n<p>\n\nAs part of a dedicated cross-functional product team, my role was to design an end-to-end customer experience embedded with user needs and backed by design research. \n\n<p>\n\nOver 12 weeks, we worked closely with the SNSW team and 2 Tech Vendors to continuously ideate, prototype and test. \n\n<p>\n\nAfter rapidly building confidence in our ideas, we launched the Energy Switch service that enables citizens to make more informed decisions about their energy providers, reduces the friction to switch, and encourages them to review their plan regularly.",
      "descriptionImage": "/images/uploads/energy-switch-2.png"
    },
    {
      "descriptionText": "<h2> The outcome </h2>\n\n<p>\n\nAfter launch, the Service NSW Energy Switch team, who we worked closely with, had embedded a cadence of testing and iteration for continuous improvement of the product and service.\n\n<p>\n\nThe initiative was so effective that leading providers responded by releasing 'no frills' plans to remain competitive.\n\n<p>\n\nAs of August 2019, Energy Switch has saved NSW residents $4,376,805 by switching providers."
    },
    {
      "descriptionText": "<h2> Team </h2>\n\n<p>\n\nEmilie Browne - Product Manager\n\n<p>\n\nMichael Forbes - Designer\n\n<p>\n\nMathieu Dauner - Strategist\n\n<p>\n\nWayne Dunkley - Developer\n\n<p>\n\nRonnie Pyne - Developer\n\n<p>\n\n<h2> Agency </h2>\n\n<p>\n\nMentally Friendly"
    }
  ]
}