{
  "name": "Zeenia Kaur",
  "thumbnail": "/images/uploads/zeenia.jpg",
  "description": "I am an action-biased Product Designer that uses human-centred design to build and deliver considered, purposeful products and services. ",
  "industries": "In my career, I’ve had the opportunity to work on high innovation projects primarily in Finance, Government, Culture, and Health sectors with some of Australia’s biggest organisations that are taking measurable steps towards creating positive social impact.",
  "experience": "I’ve spent over 6 years working for, and with, daring, innovative organisations like <a href=\"https://digital.pwc.com/en.html\">PwC Digital</a>,  <a href=\"https://mentallyfriendly.com/\" target=\"_blank\">Mentally Friendly</a>, <a href=\"https://www.service.nsw.gov.au/\" target=\"_blank\">Service NSW</a>, <a href=\"https://www.commbank.com.au/\" target=\"_blank\">Commonwealth Bank of Australia</a>, <a href=\"https://www.health.nsw.gov.au/\" target=\"_blank\">NSW Health</a>, <a href=\"https://www.service.tas.gov.au/\" target=\"_blank\">Service Tasmania</a>, <a href=\"https://www.uts.edu.au/\" target=\"_blank\">UTS</a>, <a href=\"https://www.hbf.com.au/\">HBF</a>, <a href=\"https://www.rba.gov.au/\" target=\"_blank\">Reserve Bank of Australia</a>, <a href=\"https://www.macquarie.com/au/personal/\" target=\"_blank\">Macquarie Bank</a>, and many more.",
  "hobbies": "I'm passionate about applying my skills in ways that creates meaningful change in society, and helps teams realise their potential. I thrive in fast-paced environments that allow me to continually learn new skills. At the moment I'm skilling up in Video Post-Production & Illustration.",
  "social": "I'm currently happily working as a Senior Product Designer at PwC Digital, but always up for convo. You can find me on <a href=\"https://www.linkedin.com/in/zeenia-kaur\" target=\"_blank\">linkedin</a> & <a href=\"https://www.instagram.com/zeekdesigns/\" target=\"_blank\">instagram</a>. Or we can chat the old fashioned way, via <a href=\"mailto:zeeniakaur.6@gmail.com\">email</a>."
}